xmi-get-filestore.xml

<?xml version="1.0" ?>
<!--
Request the files in a specific domain, in a specific folder.
The folder must be one of the built-in top-level folders.
 -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
        <S:Body>
                <ns2:request
                        xmlns:ns2="http://www.datapower.com/schemas/management"
                        domain="GatewayScript-Examples">
                        <ns2:get-filestore location="logtemp:" />
                </ns2:request>
        </S:Body>
</S:Envelope>


<!--
Sample response envelope.

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
        <env:Body>
                <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
                        <dp:timestamp>2015-04-20T19:36:51+01:00</dp:timestamp>
                        <dp:filestore>
                                <location name="logtemp:" read="true" log="true" show="true"
                                        del="true" list="true" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                                        <file name="gatewayscript-log">
                                                <size>1141</size>
                                                <modified>2015-04-14 23:52:27</modified>
                                        </file>
                                        <file name="default-log-xml">
                                                <size>344882</size>
                                                <modified>2015-04-14 23:52:27</modified>
                                        </file>
                                        <file name="default-log">
                                                <size>99651</size>
                                                <modified>2015-04-14 23:52:27</modified>
                                        </file>
                                </location>
                        </dp:filestore>
                </dp:response>
        </env:Body>
</env:Envelope>
-->

